# Read and write CSV and XLS Files

# READ

In [1]:
import pandas as pd
df=pd.read_csv('weather_data.csv')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [4]:
df=pd.read_excel('weather_data.xlsx')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

# Write

In [5]:
#write DF to csv
df.to_csv("new.csv")
df.to_csv("new_noIndex.csv",index=False) 
#without storing the index column index=False

In [6]:
#write DF to excel
df.to_excel("new.xlsx",sheet_name='weather_data')
#sheet name to excel file

# GROUP BY

In [7]:
df=pd.read_csv("weather_data_cities.csv")
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [8]:
g=df.groupby('city')
g

In [9]:
for city ,city_df in g:
    print(city)
    print(city_df)
#indicies of original data

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [15]:
#for city in g:
#    print(city)

In [16]:
#get specific group
g.get_group("new york")

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

In [17]:
#find max temp in each cities
print(g.max())

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [21]:
print(g.mean(numeric_only=True))

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [22]:
print(g.describe())

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

# CONCATENATE DATA FRAMES

In [24]:
#manual entry
import pandas as pd
india_weather=pd.DataFrame({
    "City":["Mumbai","Delhi","Banglore"],
    "Temperature":[30,31,32],
    "Humidty":[80,90,100]
})
india_weather

       City  Temperature  Humidty
0    Mumbai           30       80
1     Delhi           31       90
2  Banglore           32      100

In [28]:
america_weather=pd.DataFrame({
    "City":["New York","Texas","Chicago"],
    "Temperature":[20,21,22],
    "Humidty":[50,60,70]
})
america_weather

       City  Temperature  Humidty
0  New York           20       50
1     Texas           21       60
2   Chicago           22       70

In [29]:
df=pd.concat([india_weather,america_weather])
df

       City  Temperature  Humidty
0    Mumbai           30       80
1     Delhi           31       90
2  Banglore           32      100
0  New York           20       50
1     Texas           21       60
2   Chicago           22       70

In [30]:
#if we want continous index
df=pd.concat([india_weather,america_weather],ignore_index=True)
df

       City  Temperature  Humidty
0    Mumbai           30       80
1     Delhi           31       90
2  Banglore           32      100
3  New York           20       50
4     Texas           21       60
5   Chicago           22       70

# ROW WISE CONCATENATION

In [31]:
df=pd.concat([india_weather,america_weather],axis=1)
df

       City  Temperature  Humidty      City  Temperature  Humidty
0    Mumbai           30       80  New York           20       50
1     Delhi           31       90     Texas           21       60
2  Banglore           32      100   Chicago           22       70

# MERGE DATAFRAMES

In [33]:
india_temp=pd.DataFrame({
    "City":["Mumbai","Delhi","Banglore","Chandigarh"],
    "Temperature":[30,31,32,33]
    })
india_temp

         City  Temperature
0      Mumbai           30
1       Delhi           31
2    Banglore           32
3  Chandigarh           33

In [36]:
india_humid=pd.DataFrame({
    "City":["Delhi","Banglore","Chandigarh"],
    "Humidty":[30,40,50]
    })
india_humid

         City  Humidty
0       Delhi       30
1    Banglore       40
2  Chandigarh       50

In [41]:
#merge two dataframes withoy explicity mention index
df=pd.merge(india_temp,india_humid, on='City')
df

         City  Temperature  Humidty
0       Delhi           31       30
1    Banglore           32       40
2  Chandigarh           33       50

In [43]:
#outer Join
df=pd.merge(india_temp,india_humid, on='City', how='outer')
df

         City  Temperature  Humidty
0      Mumbai           30      NaN
1       Delhi           31     30.0
2    Banglore           32     40.0
3  Chandigarh           33     50.0

# Numerical Indexing

In [50]:
df=pd.DataFrame([1,2,3,4,5,6,7,8,9],index=[10,9,8,7,6,5,4,3,2])
df

    0
10  1
9   2
8   3
7   4
6   5
5   6
4   7
3   8
2   9

In [49]:
#default index
#df=pd.DataFrame([1,2,3,4,5,6,7,8,9])
#df

# .loc() creates subset or access specific rows

In [57]:
#using Index to locate data
df.loc[10]

0    1
Name: 10, dtype: int64

In [63]:
#using Index to locate data
df.loc[4:]

   0
4  7
3  8
2  9

In [64]:
df.loc[:4]

    0
10  1
9   2
8   3
7   4
6   5
5   6
4   7

In [61]:
#by usning the row no to locate data
df.iloc[0] # 0 row no is 10 index

0    1
Name: 10, dtype: int64

In [65]:
df.iloc[4:]

   0
6  5
5  6
4  7
3  8
2  9

In [66]:
df.iloc[:4]

    0
10  1
9   2
8   3
7   4